[
  {
    "settingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek",
    "settingName": "Days of the week",
    "settingDescription": null,
    "categoryId": "3ccd987e-bfca-4838-98ea-576de34b3ebe",
    "categoryName": "Certain Hours",
    "keywords": [
      "Mute",
      "Notifications",
      "Outlook",
      "Daily",
      "DaysOfTheWeek",
      "Days of the week",
      "Certain Hours"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime/MuteNotificationsDaily",
    "offsetUri": "/DaysOfTheWeek",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
      "description": null,
      "platform": "android,iOS",
      "deviceMode": "none",
      "technologies": "exchangeOnline"
    },
    "options": [
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek_0",
        "description": null,
        "helpText": null,
        "name": "Sunday",
        "displayName": "Sunday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 1
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek_1",
        "description": null,
        "helpText": null,
        "name": "Monday",
        "displayName": "Monday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 2
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek_2",
        "description": null,
        "helpText": null,
        "name": "Tuesday",
        "displayName": "Tuesday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 4
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek_3",
        "description": null,
        "helpText": null,
        "name": "Wednesday",
        "displayName": "Wednesday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 8
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek_4",
        "description": null,
        "helpText": null,
        "name": "Thursday",
        "displayName": "Thursday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 16
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek_5",
        "description": null,
        "helpText": null,
        "name": "Friday",
        "displayName": "Friday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 32
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek_6",
        "description": null,
        "helpText": null,
        "name": "Saturday",
        "displayName": "Saturday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 64
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "get",
    "version": "638869171349860765",
    "helpText": null,
    "name": "DaysOfTheWeek",
    "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek_0",
        "description": null,
        "helpText": null,
        "name": "Sunday",
        "displayName": "Sunday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 1
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek_1",
        "description": null,
        "helpText": null,
        "name": "Monday",
        "displayName": "Monday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 2
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek_2",
        "description": null,
        "helpText": null,
        "name": "Tuesday",
        "displayName": "Tuesday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 4
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek_3",
        "description": null,
        "helpText": null,
        "name": "Wednesday",
        "displayName": "Wednesday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 8
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek_4",
        "description": null,
        "helpText": null,
        "name": "Thursday",
        "displayName": "Thursday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 16
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek_5",
        "description": null,
        "helpText": null,
        "name": "Friday",
        "displayName": "Friday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 32
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek_6",
        "description": null,
        "helpText": null,
        "name": "Saturday",
        "displayName": "Saturday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 64
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily",
    "settingName": "Mute notifications daily",
    "settingDescription": null,
    "categoryId": "3ccd987e-bfca-4838-98ea-576de34b3ebe",
    "categoryName": "Certain Hours",
    "keywords": [
      "Mute",
      "Notifications",
      "Teams",
      "Outlook",
      "Daily",
      "Certain Hours"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime",
    "offsetUri": "/MuteNotificationsDaily",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
      "description": null,
      "platform": "android,iOS",
      "deviceMode": "none",
      "technologies": "exchangeOnline"
    },
    "options": [
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
        "description": null,
        "helpText": null,
        "name": "Enable",
        "displayName": "Require",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 1
        },
        "dependentOn": [],
        "dependedOnBy": [
          {
            "dependedOnBy": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek",
            "required": true
          },
          {
            "dependedOnBy": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_starttime",
            "required": true
          },
          {
            "dependedOnBy": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_endtime",
            "required": true
          }
        ]
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "get",
    "version": "638869171349860765",
    "helpText": null,
    "name": "MuteNotificationsDaily",
    "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
        "description": null,
        "helpText": null,
        "name": "Enable",
        "displayName": "Require",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 1
        },
        "dependentOn": [],
        "dependedOnBy": [
          {
            "dependedOnBy": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek",
            "required": true
          },
          {
            "dependedOnBy": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_starttime",
            "required": true
          },
          {
            "dependedOnBy": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_endtime",
            "required": true
          }
        ]
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_starttime",
    "settingName": "Start time",
    "settingDescription": null,
    "categoryId": "3ccd987e-bfca-4838-98ea-576de34b3ebe",
    "categoryName": "Certain Hours",
    "keywords": [
      "start time",
      "starttime",
      "Certain Hours"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime/MuteNotificationsDaily",
    "offsetUri": "/StartTime",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
      "description": null,
      "platform": "android,iOS",
      "deviceMode": "none",
      "technologies": "exchangeOnline"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "time",
      "inputValidationSchema": null,
      "maximumLength": 1024,
      "minimumLength": 0,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": "18:00:00"
    },
    "accessTypes": "get",
    "version": "638869171349860765",
    "helpText": null,
    "name": "StartTimeDateTime",
    "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday",
    "settingName": "Mute notifications all day",
    "settingDescription": null,
    "categoryId": "ad1ecbf4-75da-4dc1-9354-7d00c0e2af72",
    "categoryName": "Allday",
    "keywords": [
      "Mute",
      "Notifications",
      "Teams",
      "Outlook",
      "Allday"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime",
    "offsetUri": "/MuteNotificationsAllday",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
      "description": null,
      "platform": "android,iOS",
      "deviceMode": "none",
      "technologies": "exchangeOnline"
    },
    "options": [
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
        "description": null,
        "helpText": null,
        "name": "Enable",
        "displayName": "Require",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 1
        },
        "dependentOn": [],
        "dependedOnBy": [
          {
            "dependedOnBy": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek",
            "required": true
          }
        ]
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "get",
    "version": "638869171349860765",
    "helpText": null,
    "name": "MuteNotificationsAllday",
    "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
        "description": null,
        "helpText": null,
        "name": "Enable",
        "displayName": "Require",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 1
        },
        "dependentOn": [],
        "dependedOnBy": [
          {
            "dependedOnBy": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek",
            "required": true
          }
        ]
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek",
    "settingName": "Days of the week",
    "settingDescription": null,
    "categoryId": "ad1ecbf4-75da-4dc1-9354-7d00c0e2af72",
    "categoryName": "Allday",
    "keywords": [
      "Mute",
      "Notifications",
      "Outlook",
      "Allday",
      "All day",
      "DaysOfTheWeek",
      "Days of the week"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime/MuteNotificationsAllday",
    "offsetUri": "/DaysOfTheWeek",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
      "description": null,
      "platform": "android,iOS",
      "deviceMode": "none",
      "technologies": "exchangeOnline"
    },
    "options": [
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_0",
        "description": null,
        "helpText": null,
        "name": "Sunday",
        "displayName": "Sunday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 1
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_1",
        "description": null,
        "helpText": null,
        "name": "Monday",
        "displayName": "Monday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 2
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_2",
        "description": null,
        "helpText": null,
        "name": "Tuesday",
        "displayName": "Tuesday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 4
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_3",
        "description": null,
        "helpText": null,
        "name": "Wednesday",
        "displayName": "Wednesday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 8
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_4",
        "description": null,
        "helpText": null,
        "name": "Thursday",
        "displayName": "Thursday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 16
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_5",
        "description": null,
        "helpText": null,
        "name": "Friday",
        "displayName": "Friday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 32
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_6",
        "description": null,
        "helpText": null,
        "name": "Saturday",
        "displayName": "Saturday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 64
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "get",
    "version": "638869171349860765",
    "helpText": null,
    "name": "DaysOfTheWeek",
    "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_0",
        "description": null,
        "helpText": null,
        "name": "Sunday",
        "displayName": "Sunday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 1
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_1",
        "description": null,
        "helpText": null,
        "name": "Monday",
        "displayName": "Monday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 2
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_2",
        "description": null,
        "helpText": null,
        "name": "Tuesday",
        "displayName": "Tuesday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 4
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_3",
        "description": null,
        "helpText": null,
        "name": "Wednesday",
        "displayName": "Wednesday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 8
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_4",
        "description": null,
        "helpText": null,
        "name": "Thursday",
        "displayName": "Thursday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 16
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_5",
        "description": null,
        "helpText": null,
        "name": "Friday",
        "displayName": "Friday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 32
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_6",
        "description": null,
        "helpText": null,
        "name": "Saturday",
        "displayName": "Saturday",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 64
        },
        "dependentOn": [
          {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_endtime",
    "settingName": "End time",
    "settingDescription": null,
    "categoryId": "3ccd987e-bfca-4838-98ea-576de34b3ebe",
    "categoryName": "Certain Hours",
    "keywords": [
      "end time",
      "endtime",
      "Certain Hours"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime/MuteNotificationsDaily",
    "offsetUri": "/EndTime",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
      "description": null,
      "platform": "android,iOS",
      "deviceMode": "none",
      "technologies": "exchangeOnline"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "time",
      "inputValidationSchema": null,
      "maximumLength": 1024,
      "minimumLength": 0,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": "07:00:00"
    },
    "accessTypes": "get",
    "version": "638869171349860765",
    "helpText": null,
    "name": "EndTime",
    "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  }
]