[
  {
    "settingId": "com.apple.managedclient.preferences_exclusionsmergepolicy",
    "settingName": "Exclusions merge",
    "settingDescription": "Specify the merge policy for exclusions. This can be a combination of administrator-defined and user-defined exclusions (merge) or only administrator-defined exclusions (admin_only). This setting can be used to restrict local users from defining their own exclusions.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#exclusion-merge-policy"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "exclusionsMergePolicy",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_exclusionsmergepolicy_0",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_exclusionsmergepolicy_0",
        "description": null,
        "helpText": null,
        "name": "merge",
        "displayName": "merge",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "merge"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_exclusionsmergepolicy_1",
        "description": null,
        "helpText": null,
        "name": "admin_only",
        "displayName": "admin_only",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "admin_only"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusionsMergePolicy",
    "rootDefinitionId": "com.apple.managedclient.preferences_exclusionsmergepolicy",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_exclusionsmergepolicy_0",
        "description": null,
        "helpText": null,
        "name": "merge",
        "displayName": "merge",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "merge"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_exclusionsmergepolicy_1",
        "description": null,
        "helpText": null,
        "name": "admin_only",
        "displayName": "admin_only",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "admin_only"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_passivemode",
    "settingName": "Enable passive mode (deprecated)",
    "settingDescription": "Whether the antivirus engine runs in passive mode or not.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#enable--disable-passive-mode"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "passiveMode",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_passivemode_false",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_passivemode_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_passivemode_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "passiveMode",
    "rootDefinitionId": "com.apple.managedclient.preferences_passivemode",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_passivemode_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_passivemode_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine",
    "settingName": "Enforcement level",
    "settingDescription": "Antivirus engine enforcement mode",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#enforcement-level-for-antivirus-engine"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "enforcementLevel",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_0",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_0",
        "description": null,
        "helpText": null,
        "name": "passive",
        "displayName": "passive",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "passive"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_1",
        "description": null,
        "helpText": null,
        "name": "on_demand",
        "displayName": "on_demand",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "on_demand"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_2",
        "description": null,
        "helpText": null,
        "name": "real_time",
        "displayName": "real_time",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "real_time"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "enforcementLevel",
    "rootDefinitionId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_0",
        "description": null,
        "helpText": null,
        "name": "passive",
        "displayName": "passive",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "passive"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_1",
        "description": null,
        "helpText": null,
        "name": "on_demand",
        "displayName": "on_demand",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "on_demand"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_2",
        "description": null,
        "helpText": null,
        "name": "real_time",
        "displayName": "real_time",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "real_time"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_exclusions_item_extension",
    "settingName": "File extension",
    "settingDescription": null,
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "exclusions/[{0}]/extension",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "none",
      "inputValidationSchema": null,
      "maximumLength": 1032,
      "minimumLength": 1,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": ""
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions_item_extension",
    "rootDefinitionId": "com.apple.managedclient.preferences_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_enabled",
    "settingName": "Enable / disable cloud delivered protection",
    "settingDescription": "Whether cloud delivered protection is enabled on the device or not. To improve the security of your services, we recommend keeping this feature turned on.",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Cloud delivered protection preferences",
      "Cloud delivered protection preferences"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#enable--disable-cloud-delivered-protection"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/cloudService",
    "offsetUri": "enabled",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_enabled_true",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_enabled_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_enabled_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "enabled",
    "rootDefinitionId": "com.apple.managedclient.preferences_enabled",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_enabled_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_enabled_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_edr_tags",
    "settingName": "Device tags",
    "settingDescription": null,
    "categoryId": "22a2a407-0f28-481d-bdbe-1f9cb6d589c3",
    "categoryName": "Microsoft Defender",
    "keywords": [
      " EDR preferences"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#add-tag-or-group-id-to-the-configuration-profile"
    ],
    "baseUri": "PayloadContent/edr",
    "offsetUri": "tags",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "tags",
    "rootDefinitionId": "linux_mdatp_managed_edr_tags",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_enforcementlevel",
    "settingName": "Enforcement Level",
    "settingDescription": "Specifies the enforcement preference of antivirus engine. Real-time: Real-time protection (scan files as they're modified) is enabled. On-demand: Files are scanned only on demand and real-time protection is turned off. Passive: Runs the antivirus engine in passive mode.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/linux-preferences?view=o365-worldwide#enforcement-level-for-antivirus-engine"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "enforcementLevel",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_enforcementlevel_2",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_enforcementlevel_0",
        "description": null,
        "helpText": null,
        "name": "Realtime",
        "displayName": "Realtime",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "real_time"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_enforcementlevel_1",
        "description": null,
        "helpText": null,
        "name": "OnDemand",
        "displayName": "OnDemand",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "on_demand"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_enforcementlevel_2",
        "description": null,
        "helpText": null,
        "name": "Passive",
        "displayName": "Passive",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "passive"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "enforcementLevel",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_enforcementlevel",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_enforcementlevel_0",
        "description": null,
        "helpText": null,
        "name": "Realtime",
        "displayName": "Realtime",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "real_time"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_enforcementlevel_1",
        "description": null,
        "helpText": null,
        "name": "OnDemand",
        "displayName": "OnDemand",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "on_demand"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_enforcementlevel_2",
        "description": null,
        "helpText": null,
        "name": "Passive",
        "displayName": "Passive",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "passive"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_behaviormonitoring",
    "settingName": "Enable behavior monitoring",
    "settingDescription": "Whether the antivirus engine runs behavior monitoring and blocking or not.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/linux-preferences?view=o365-worldwide#enabledisable-behavior-monitoring"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "behaviorMonitoring",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_behaviormonitoring_0",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_behaviormonitoring_0",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "disabled"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_behaviormonitoring_1",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "enabled"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "behaviorMonitoring",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_behaviormonitoring",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_behaviormonitoring_0",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "disabled"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_behaviormonitoring_1",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "enabled"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_maximumondemandscanthreads",
    "settingName": "maximum on demand scan threads",
    "settingDescription": "Specify the maximum number of number of threads used to perform the on demand scan.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#maximum-number-of-items-in-the-antivirus-scan-history"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "maximumOnDemandScanThreads",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
      "maximumValue": 64,
      "minimumValue": 1
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
      "settingValueTemplateReference": null,
      "value": 2
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "maximumOnDemandScanThreads",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_maximumondemandscanthreads",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_scanresultsretentiondays",
    "settingName": "Scan results retention",
    "settingDescription": "Specify the number of days that results are retained in the scan history on the device. Old scan results are removed from the history. Old quarantined files that are also removed from the disk.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#antivirus-scan-history-retention-in-days"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "scanResultsRetentionDays",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
      "maximumValue": 180,
      "minimumValue": 1
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
      "settingValueTemplateReference": null,
      "value": 90
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "scanResultsRetentionDays",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_scanresultsretentiondays",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_passivemode",
    "settingName": "Enable passive mode (deprecated)",
    "settingDescription": "Whether the antivirus engine runs in passive mode or not.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#enable--disable-passive-mode"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "passiveMode",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_passivemode_false",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_passivemode_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_passivemode_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "passiveMode",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_passivemode",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_passivemode_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_passivemode_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_exclusions_item_extension",
    "settingName": "File extension",
    "settingDescription": null,
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "exclusions/[{0}]/extension",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "none",
      "inputValidationSchema": null,
      "maximumLength": 0,
      "minimumLength": 0,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": ""
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions_item_extension",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_exclusions_item_name",
    "settingName": "File name",
    "settingDescription": "Process name, either or full path or file name, wildcards supported",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "exclusions/[{0}]/name",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "none",
      "inputValidationSchema": null,
      "maximumLength": 0,
      "minimumLength": 0,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": ""
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions_item_name",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_cloudservice_cloudblocklevel",
    "settingName": "Configure cloud block level",
    "settingDescription": "Determines how aggressive Defender for Endpoint is in blocking and scanning suspicious files.",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Cloud delivered protection preferences"
    ],
    "infoUrls": [
      "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/linux-preferences?view=o365-worldwide#configure-cloud-block-level"
    ],
    "baseUri": "PayloadContent/cloudService",
    "offsetUri": "cloudBlockLevel",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_cloudservice_cloudblocklevel_normal",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_normal",
        "description": null,
        "helpText": null,
        "name": "Normal",
        "displayName": "Normal",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "normal"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_moderate",
        "description": null,
        "helpText": null,
        "name": "Moderate",
        "displayName": "Moderate",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "moderate"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_high",
        "description": null,
        "helpText": null,
        "name": "High",
        "displayName": "High",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "high"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_high_plus",
        "description": null,
        "helpText": null,
        "name": "High_Plus",
        "displayName": "High_Plus",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "high_plus"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_zero_tolerance",
        "description": null,
        "helpText": null,
        "name": "Zero_Tolerance",
        "displayName": "Zero_Tolerance",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "zero_tolerance"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "cloudBlockLevel",
    "rootDefinitionId": "linux_mdatp_managed_cloudservice_cloudblocklevel",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_normal",
        "description": null,
        "helpText": null,
        "name": "Normal",
        "displayName": "Normal",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "normal"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_moderate",
        "description": null,
        "helpText": null,
        "name": "Moderate",
        "displayName": "Moderate",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "moderate"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_high",
        "description": null,
        "helpText": null,
        "name": "High",
        "displayName": "High",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "high"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_high_plus",
        "description": null,
        "helpText": null,
        "name": "High_Plus",
        "displayName": "High_Plus",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "high_plus"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_zero_tolerance",
        "description": null,
        "helpText": null,
        "name": "Zero_Tolerance",
        "displayName": "Zero_Tolerance",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "zero_tolerance"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_exclusionsettings_exclusions_item_path",
    "settingName": "Path",
    "settingDescription": "Path to exclude, wildcards are NOT supported",
    "categoryId": "d2191717-e304-46f7-bcc0-55e6477026c9",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Exclusion Settings"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/exclusionSettings",
    "offsetUri": "exclusions/[{0}]/path",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "none",
      "inputValidationSchema": null,
      "maximumLength": 0,
      "minimumLength": 0,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": ""
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions_item_path",
    "rootDefinitionId": "linux_mdatp_managed_exclusionsettings_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_scanresultsretentiondays",
    "settingName": "Scan results retention",
    "settingDescription": "Specify the number of days that results are retained in the scan history on the device. Old scan results are removed from the history. Old quarantined files that are also removed from the disk.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#antivirus-scan-history-retention-in-days"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "scanResultsRetentionDays",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
      "maximumValue": 180,
      "minimumValue": 1
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
      "settingValueTemplateReference": null,
      "value": 90
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "scanResultsRetentionDays",
    "rootDefinitionId": "com.apple.managedclient.preferences_scanresultsretentiondays",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_allowedthreats",
    "settingName": "Allowed threats",
    "settingDescription": "List of threats (identified by their name) that are not blocked by the product and are instead allowed to run.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#allowed-threats"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "allowedThreats",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "none",
      "inputValidationSchema": null,
      "maximumLength": 1032,
      "minimumLength": 0,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": ""
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "allowedThreats",
    "rootDefinitionId": "com.apple.managedclient.preferences_allowedthreats",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_scanarchives",
    "settingName": "Scanning inside archive files",
    "settingDescription": "If true, Defender will unpack archives and scan files inside them. Otherwise archive content will be skipped, that will improve scanning performance.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences?view=o365-worldwide#scan-archives-on-demand-antivirus-scans-only"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "scanArchives",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_scanarchives_true",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_scanarchives_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "False",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_scanarchives_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "True",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "scanArchives",
    "rootDefinitionId": "com.apple.managedclient.preferences_scanarchives",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_scanarchives_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "False",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_scanarchives_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "True",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_threattypesettings_item_key",
    "settingName": "Threat type",
    "settingDescription": "Type of the threat for which the behavior is configured.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "threatTypeSettings/[{0}]/key",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_threattypesettings_item_key_0",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_threattypesettings_item_key_0",
        "description": null,
        "helpText": null,
        "name": "potentially_unwanted_application",
        "displayName": "potentially_unwanted_application",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "potentially_unwanted_application"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_threattypesettings",
            "parentSettingId": "com.apple.managedclient.preferences_threattypesettings"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_threattypesettings_item_key_1",
        "description": null,
        "helpText": null,
        "name": "archive_bomb",
        "displayName": "archive_bomb",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "archive_bomb"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_threattypesettings",
            "parentSettingId": "com.apple.managedclient.preferences_threattypesettings"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "threatTypeSettings_item_key",
    "rootDefinitionId": "com.apple.managedclient.preferences_threattypesettings",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_threattypesettings_item_key_0",
        "description": null,
        "helpText": null,
        "name": "potentially_unwanted_application",
        "displayName": "potentially_unwanted_application",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "potentially_unwanted_application"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_threattypesettings",
            "parentSettingId": "com.apple.managedclient.preferences_threattypesettings"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_threattypesettings_item_key_1",
        "description": null,
        "helpText": null,
        "name": "archive_bomb",
        "displayName": "archive_bomb",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "archive_bomb"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_threattypesettings",
            "parentSettingId": "com.apple.managedclient.preferences_threattypesettings"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_threattypesettingsmergepolicy",
    "settingName": "Threat type settings merge",
    "settingDescription": "Specify the merge policy for threat type settings. This can be a combination of administrator-defined and user-defined settings (merge) or only administrator-defined settings (admin_only). This setting can be used to restrict local users from defining their own settings for different threat types.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#threat-type-settings-merge-policy"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "threatTypeSettingsMergePolicy",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_threattypesettingsmergepolicy_0",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_threattypesettingsmergepolicy_0",
        "description": null,
        "helpText": null,
        "name": "merge",
        "displayName": "merge",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "merge"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_threattypesettingsmergepolicy_1",
        "description": null,
        "helpText": null,
        "name": "admin_only",
        "displayName": "admin_only",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "admin_only"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "threatTypeSettingsMergePolicy",
    "rootDefinitionId": "com.apple.managedclient.preferences_threattypesettingsmergepolicy",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_threattypesettingsmergepolicy_0",
        "description": null,
        "helpText": null,
        "name": "merge",
        "displayName": "merge",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "merge"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_threattypesettingsmergepolicy_1",
        "description": null,
        "helpText": null,
        "name": "admin_only",
        "displayName": "admin_only",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "admin_only"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_threattypesettings_item_value",
    "settingName": "Action to take",
    "settingDescription": "Action to take when coming across a threat of the type specified in the preceding section.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "threatTypeSettings/[{0}]/value",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_threattypesettings_item_value_0",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_threattypesettings_item_value_0",
        "description": null,
        "helpText": null,
        "name": "audit",
        "displayName": "audit",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "audit"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_threattypesettings",
            "parentSettingId": "com.apple.managedclient.preferences_threattypesettings"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_threattypesettings_item_value_1",
        "description": null,
        "helpText": null,
        "name": "block",
        "displayName": "block",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "block"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_threattypesettings",
            "parentSettingId": "com.apple.managedclient.preferences_threattypesettings"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_threattypesettings_item_value_2",
        "description": null,
        "helpText": null,
        "name": "off",
        "displayName": "off",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "off"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_threattypesettings",
            "parentSettingId": "com.apple.managedclient.preferences_threattypesettings"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "threatTypeSettings_item_value",
    "rootDefinitionId": "com.apple.managedclient.preferences_threattypesettings",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_threattypesettings_item_value_0",
        "description": null,
        "helpText": null,
        "name": "audit",
        "displayName": "audit",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "audit"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_threattypesettings",
            "parentSettingId": "com.apple.managedclient.preferences_threattypesettings"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_threattypesettings_item_value_1",
        "description": null,
        "helpText": null,
        "name": "block",
        "displayName": "block",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "block"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_threattypesettings",
            "parentSettingId": "com.apple.managedclient.preferences_threattypesettings"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_threattypesettings_item_value_2",
        "description": null,
        "helpText": null,
        "name": "off",
        "displayName": "off",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "off"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_threattypesettings",
            "parentSettingId": "com.apple.managedclient.preferences_threattypesettings"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_enablefilehashcomputation",
    "settingName": "Enable file hash computation",
    "settingDescription": "Enables or disables file hash computation feature. When this feature is enabled Windows defender will compute hashes for files it scans. This will help in improving the accuracy of Custom Indicator matches. However, enabling Enable file hash computation may impact device performance.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences?view=o365-worldwide#configure-file-hash-computation-feature"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "enableFileHashComputation",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_enablefilehashcomputation_false",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_enablefilehashcomputation_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "False",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_enablefilehashcomputation_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "True",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "enableFileHashComputation",
    "rootDefinitionId": "com.apple.managedclient.preferences_enablefilehashcomputation",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_enablefilehashcomputation_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "False",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_enablefilehashcomputation_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "True",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_scanafterdefinitionupdate",
    "settingName": "Run a scan after definitions are updated",
    "settingDescription": "Specifies whether to start a process scan after new security intelligence updates are downloaded on the device. Enabling this setting will trigger an antivirus scan on the running processes of the device.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences?view=o365-worldwide#run-a-scan-after-definitions-are-updated"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "scanAfterDefinitionUpdate",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_scanafterdefinitionupdate_true",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_scanafterdefinitionupdate_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_scanafterdefinitionupdate_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "scanAfterDefinitionUpdate",
    "rootDefinitionId": "com.apple.managedclient.preferences_scanafterdefinitionupdate",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_scanafterdefinitionupdate_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_scanafterdefinitionupdate_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_edr_tags_item_value",
    "settingName": "Value of tag",
    "settingDescription": "Only one value per tag type can be set. Type of tags are unique, and should not be repeated in the same configuration profile.",
    "categoryId": "22a2a407-0f28-481d-bdbe-1f9cb6d589c3",
    "categoryName": "Microsoft Defender",
    "keywords": [
      " EDR preferences"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/edr",
    "offsetUri": "tags/[{0}]/value",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "none",
      "inputValidationSchema": null,
      "maximumLength": 0,
      "minimumLength": 0,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": ""
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "tags_item_value",
    "rootDefinitionId": "linux_mdatp_managed_edr_tags",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_unmonitoredfilesystems",
    "settingName": "Unmonitored Filesystems",
    "settingDescription": "List of filesystems (identified by their name) to be unmonitored/excluded from Real Time Protection(RTP).",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/linux-preferences?view=o365-worldwide#unmonitor-filesystems"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "unmonitoredFilesystems",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "none",
      "inputValidationSchema": null,
      "maximumLength": 0,
      "minimumLength": 0,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": ""
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "unmonitoredFilesystems",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_unmonitoredfilesystems",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_threattypesettingsmergepolicy",
    "settingName": "Threat type settings merge",
    "settingDescription": "Specify the merge policy for threat type settings. This can be a combination of administrator-defined and user-defined settings (merge) or only administrator-defined settings (admin_only). This setting can be used to restrict local users from defining their own settings for different threat types.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#threat-type-settings-merge-policy"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "threatTypeSettingsMergePolicy",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_threattypesettingsmergepolicy_0",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_threattypesettingsmergepolicy_0",
        "description": null,
        "helpText": null,
        "name": "merge",
        "displayName": "merge",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "merge"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_threattypesettingsmergepolicy_1",
        "description": null,
        "helpText": null,
        "name": "admin_only",
        "displayName": "admin_only",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "admin_only"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "threatTypeSettingsMergePolicy",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_threattypesettingsmergepolicy",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_threattypesettingsmergepolicy_0",
        "description": null,
        "helpText": null,
        "name": "merge",
        "displayName": "merge",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "merge"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_threattypesettingsmergepolicy_1",
        "description": null,
        "helpText": null,
        "name": "admin_only",
        "displayName": "admin_only",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "admin_only"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_disallowedthreatactions",
    "settingName": "Disallowed threat actions",
    "settingDescription": "Restricts the actions that the local user of a device can take when threats are detected. The actions included in this list are not displayed in the user interface.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#disallowed-threat-actions"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "disallowedThreatActions",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "none",
      "inputValidationSchema": null,
      "maximumLength": 0,
      "minimumLength": 0,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": ""
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "disallowedThreatActions",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_disallowedthreatactions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_exclusions_item_path",
    "settingName": "Path",
    "settingDescription": "Path to exclude, wildcards are supported",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "exclusions/[{0}]/path",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "none",
      "inputValidationSchema": null,
      "maximumLength": 0,
      "minimumLength": 0,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": ""
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions_item_path",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_exclusionsettings_exclusions_item_name",
    "settingName": "Process name",
    "settingDescription": "Process name, either or full path or file name, wildcards NOT supported",
    "categoryId": "d2191717-e304-46f7-bcc0-55e6477026c9",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Exclusion Settings"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/exclusionSettings",
    "offsetUri": "exclusions/[{0}]/name",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "none",
      "inputValidationSchema": null,
      "maximumLength": 0,
      "minimumLength": 0,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": ""
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions_item_name",
    "rootDefinitionId": "linux_mdatp_managed_exclusionsettings_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_exclusionsettings_exclusions",
    "settingName": "Global Exclusions",
    "settingDescription": "Global exclusions apply to both Antivirus and Endpoint detection and response to exclude at a much lower level closer to sensors. Usage: Tackling performance issues. Risk: Significantly risks protection",
    "categoryId": "d2191717-e304-46f7-bcc0-55e6477026c9",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Exclusion Settings"
    ],
    "infoUrls": [
      "https://learn.microsoft.com/en-us/defender-endpoint/linux-preferences#exclusion-setting-preferences"
    ],
    "baseUri": "PayloadContent/exclusionSettings",
    "offsetUri": "exclusions",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions",
    "rootDefinitionId": "linux_mdatp_managed_exclusionsettings_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_threattypesettings",
    "settingName": "Threat type settings",
    "settingDescription": "The threatTypeSettings preference in the antivirus engine is used to control how certain threat types are handled by the product.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#threat-type-settings"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "threatTypeSettings",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "threatTypeSettings",
    "rootDefinitionId": "com.apple.managedclient.preferences_threattypesettings",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_exclusions_item_isdirectory",
    "settingName": "Directory (selected) or file (not selected)",
    "settingDescription": "Directory if selected, or file if not selected",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "exclusions/[{0}]/isDirectory",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_exclusions_item_isdirectory_true",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_exclusions_item_isdirectory_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_exclusions_item_$type_0",
            "parentSettingId": "com.apple.managedclient.preferences_exclusions_item_$type"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_exclusions_item_isdirectory_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_exclusions_item_$type_0",
            "parentSettingId": "com.apple.managedclient.preferences_exclusions_item_$type"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions_item_isDirectory",
    "rootDefinitionId": "com.apple.managedclient.preferences_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_exclusions_item_isdirectory_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_exclusions_item_$type_0",
            "parentSettingId": "com.apple.managedclient.preferences_exclusions_item_$type"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_exclusions_item_isdirectory_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_exclusions_item_$type_0",
            "parentSettingId": "com.apple.managedclient.preferences_exclusions_item_$type"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_exclusions_item_$type",
    "settingName": "Type",
    "settingDescription": null,
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "exclusions/[{0}]/$type",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_exclusions_item_$type_0",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_exclusions_item_$type_0",
        "description": null,
        "helpText": null,
        "name": "Path",
        "displayName": "Path",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedPath"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_exclusions",
            "parentSettingId": "com.apple.managedclient.preferences_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "com.apple.managedclient.preferences_exclusions_item_isdirectory",
            "required": true
          },
          {
            "dependedOnBy": "com.apple.managedclient.preferences_exclusions_item_path",
            "required": true
          }
        ]
      },
      {
        "itemId": "com.apple.managedclient.preferences_exclusions_item_$type_1",
        "description": null,
        "helpText": null,
        "name": "File extension",
        "displayName": "File extension",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedFileExtension"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_exclusions",
            "parentSettingId": "com.apple.managedclient.preferences_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "com.apple.managedclient.preferences_exclusions_item_extension",
            "required": true
          }
        ]
      },
      {
        "itemId": "com.apple.managedclient.preferences_exclusions_item_$type_2",
        "description": null,
        "helpText": null,
        "name": "Process name",
        "displayName": "File name",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedFileName"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_exclusions",
            "parentSettingId": "com.apple.managedclient.preferences_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "com.apple.managedclient.preferences_exclusions_item_name",
            "required": true
          }
        ]
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions_item_$type",
    "rootDefinitionId": "com.apple.managedclient.preferences_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_exclusions_item_$type_0",
        "description": null,
        "helpText": null,
        "name": "Path",
        "displayName": "Path",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedPath"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_exclusions",
            "parentSettingId": "com.apple.managedclient.preferences_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "com.apple.managedclient.preferences_exclusions_item_isdirectory",
            "required": true
          },
          {
            "dependedOnBy": "com.apple.managedclient.preferences_exclusions_item_path",
            "required": true
          }
        ]
      },
      {
        "itemId": "com.apple.managedclient.preferences_exclusions_item_$type_1",
        "description": null,
        "helpText": null,
        "name": "File extension",
        "displayName": "File extension",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedFileExtension"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_exclusions",
            "parentSettingId": "com.apple.managedclient.preferences_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "com.apple.managedclient.preferences_exclusions_item_extension",
            "required": true
          }
        ]
      },
      {
        "itemId": "com.apple.managedclient.preferences_exclusions_item_$type_2",
        "description": null,
        "helpText": null,
        "name": "Process name",
        "displayName": "File name",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedFileName"
        },
        "dependentOn": [
          {
            "dependentOn": "com.apple.managedclient.preferences_exclusions",
            "parentSettingId": "com.apple.managedclient.preferences_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "com.apple.managedclient.preferences_exclusions_item_name",
            "required": true
          }
        ]
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_disallowedthreatactions",
    "settingName": "Disallowed threat actions",
    "settingDescription": "Restricts the actions that the local user of a device can take when threats are detected. The actions included in this list are not displayed in the user interface.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#disallowed-threat-actions"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "disallowedThreatActions",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "none",
      "inputValidationSchema": null,
      "maximumLength": 1032,
      "minimumLength": 0,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": ""
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "disallowedThreatActions",
    "rootDefinitionId": "com.apple.managedclient.preferences_disallowedthreatactions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_diagnosticlevel",
    "settingName": "Diagnostic collection level",
    "settingDescription": "Diagnostic data is used to keep Microsoft Defender ATP secure and up-to-date, detect, diagnose and fix problems, and also make product improvements. This setting determines the level of diagnostics sent by the product to Microsoft.",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Cloud delivered protection preferences",
      "Cloud delivered protection preferences"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#diagnostic-collection-level"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/cloudService",
    "offsetUri": "diagnosticLevel",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_diagnosticlevel_0",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_diagnosticlevel_0",
        "description": null,
        "helpText": null,
        "name": "optional",
        "displayName": "optional",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "optional"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_diagnosticlevel_1",
        "description": null,
        "helpText": null,
        "name": "required",
        "displayName": "required",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "required"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "diagnosticLevel",
    "rootDefinitionId": "com.apple.managedclient.preferences_diagnosticlevel",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_diagnosticlevel_0",
        "description": null,
        "helpText": null,
        "name": "optional",
        "displayName": "optional",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "optional"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_diagnosticlevel_1",
        "description": null,
        "helpText": null,
        "name": "required",
        "displayName": "required",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "required"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_edr_tags_item_key",
    "settingName": "Type of tag",
    "settingDescription": "Specify a tag name and its value. The GROUP tag, tags the device with the specified value. The tag is reflected in the portal under the device page and can be used for filtering and grouping devices.",
    "categoryId": "22a2a407-0f28-481d-bdbe-1f9cb6d589c3",
    "categoryName": "Microsoft Defender",
    "keywords": [
      " EDR preferences"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/edr",
    "offsetUri": "tags/[{0}]/key",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_edr_tags_item_key_0",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_edr_tags_item_key_0",
        "description": null,
        "helpText": null,
        "name": "GROUP",
        "displayName": "GROUP",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "GROUP"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_edr_tags",
            "parentSettingId": "linux_mdatp_managed_edr_tags"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "tags_item_key",
    "rootDefinitionId": "linux_mdatp_managed_edr_tags",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_edr_tags_item_key_0",
        "description": null,
        "helpText": null,
        "name": "GROUP",
        "displayName": "GROUP",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "GROUP"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_edr_tags",
            "parentSettingId": "linux_mdatp_managed_edr_tags"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_allowedthreats",
    "settingName": "Allowed threats",
    "settingDescription": "List of threats (identified by their name) that are not blocked by the product and are instead allowed to run.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/linux-preferences?view=o365-worldwide#allowed-threats"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "allowedThreats",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "none",
      "inputValidationSchema": null,
      "maximumLength": 0,
      "minimumLength": 0,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": ""
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "allowedThreats",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_allowedthreats",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_exclusionsmergepolicy",
    "settingName": "Exclusions merge",
    "settingDescription": "Specify the merge policy for exclusions. This can be a combination of administrator-defined and user-defined exclusions (merge) or only administrator-defined exclusions (admin_only). This setting can be used to restrict local users from defining their own exclusions.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#exclusion-merge-policy"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "exclusionsMergePolicy",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_exclusionsmergepolicy_0",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_exclusionsmergepolicy_0",
        "description": null,
        "helpText": null,
        "name": "merge",
        "displayName": "merge",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "merge"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_exclusionsmergepolicy_1",
        "description": null,
        "helpText": null,
        "name": "admin_only",
        "displayName": "admin_only",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "admin_only"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusionsMergePolicy",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_exclusionsmergepolicy",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_exclusionsmergepolicy_0",
        "description": null,
        "helpText": null,
        "name": "merge",
        "displayName": "merge",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "merge"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_exclusionsmergepolicy_1",
        "description": null,
        "helpText": null,
        "name": "admin_only",
        "displayName": "admin_only",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "admin_only"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_threattypesettings",
    "settingName": "Threat type settings",
    "settingDescription": "The threatTypeSettings preference in the antivirus engine is used to control how certain threat types are handled by the product.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#threat-type-settings"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "threatTypeSettings",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "threatTypeSettings",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_threattypesettings",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_exclusions_item_isdirectory",
    "settingName": "Is directory",
    "settingDescription": "Directory if selected, or file if not selected",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "exclusions/[{0}]/isDirectory",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_exclusions_item_isdirectory_true",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_exclusions_item_isdirectory_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_exclusions_item_$type_0",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_exclusions_item_$type"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_exclusions_item_isdirectory_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_exclusions_item_$type_0",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_exclusions_item_$type"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions_item_isDirectory",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_exclusions_item_isdirectory_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_exclusions_item_$type_0",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_exclusions_item_$type"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_exclusions_item_isdirectory_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_exclusions_item_$type_0",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_exclusions_item_$type"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_key",
    "settingName": "Threat type",
    "settingDescription": "Type of the threat for which the behavior is configured.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "threatTypeSettings/[{0}]/key",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_key_0",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_key_0",
        "description": null,
        "helpText": null,
        "name": "potentially_unwanted_application",
        "displayName": "potentially_unwanted_application",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "potentially_unwanted_application"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_key_1",
        "description": null,
        "helpText": null,
        "name": "archive_bomb",
        "displayName": "archive_bomb",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "archive_bomb"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "threatTypeSettings_item_key",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_threattypesettings",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_key_0",
        "description": null,
        "helpText": null,
        "name": "potentially_unwanted_application",
        "displayName": "potentially_unwanted_application",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "potentially_unwanted_application"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_key_1",
        "description": null,
        "helpText": null,
        "name": "archive_bomb",
        "displayName": "archive_bomb",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "archive_bomb"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_scanhistorymaximumitems",
    "settingName": "Scan history size",
    "settingDescription": "Specify the maximum number of entries to keep in the scan history. Entries include all on-demand scans performed in the past and all antivirus detections.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#maximum-number-of-items-in-the-antivirus-scan-history"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "scanHistoryMaximumItems",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
      "maximumValue": 15000,
      "minimumValue": 5000
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
      "settingValueTemplateReference": null,
      "value": 10000
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "scanHistoryMaximumItems",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_scanhistorymaximumitems",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_exclusions",
    "settingName": "Scan exclusions",
    "settingDescription": "Entities that have been excluded from the scan. Exclusions can be specified by full paths, extensions, or file names.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#scan-exclusions"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "exclusions",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_enablefilehashcomputation",
    "settingName": "Enable file hash computation",
    "settingDescription": "Whether the antivirus engine computes hashes for the files it scans or not.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/linux-preferences?view=o365-worldwide#configure-file-hash-computation-feature"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "enableFileHashComputation",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_enablefilehashcomputation_false",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_enablefilehashcomputation_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_enablefilehashcomputation_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "enableFileHashComputation",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_enablefilehashcomputation",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_enablefilehashcomputation_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_enablefilehashcomputation_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_scanarchives",
    "settingName": "Enable scanning of archives",
    "settingDescription": "Specifies whether to scan archives during on-demand antivirus scans.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/linux-preferences?view=o365-worldwide#scan-archives-on-demand-antivirus-scans-only"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "scanArchives",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_scanarchives_true",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_scanarchives_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_scanarchives_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "scanArchives",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_scanarchives",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_scanarchives_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_scanarchives_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_cloudservice_enabled",
    "settingName": "Enable cloud delivered protection",
    "settingDescription": "Provides increased, faster protection with access to the latest protection data in the cloud. Works best with automatic sample submission turned on",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Cloud delivered protection preferences",
      "Cloud delivered protection preferences"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#enable--disable-cloud-delivered-protection"
    ],
    "baseUri": "PayloadContent/cloudService",
    "offsetUri": "enabled",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_cloudservice_enabled_true",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_cloudservice_enabled_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_enabled_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "enabled",
    "rootDefinitionId": "linux_mdatp_managed_cloudservice_enabled",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_cloudservice_enabled_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_enabled_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_cloudservice_automaticdefinitionupdateenabled",
    "settingName": "Automatic security intelligence updates",
    "settingDescription": "Determines whether security intelligence updates are installed automatically:",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Cloud delivered protection preferences",
      "Cloud delivered protection preferences"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#enable--disable-automatic-security-intelligence-updates"
    ],
    "baseUri": "PayloadContent/cloudService",
    "offsetUri": "automaticDefinitionUpdateEnabled",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_cloudservice_automaticdefinitionupdateenabled_true",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_cloudservice_automaticdefinitionupdateenabled_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_automaticdefinitionupdateenabled_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "automaticDefinitionUpdateEnabled",
    "rootDefinitionId": "linux_mdatp_managed_cloudservice_automaticdefinitionupdateenabled",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_cloudservice_automaticdefinitionupdateenabled_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_automaticdefinitionupdateenabled_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent",
    "settingName": "Enable automatic sample submissions",
    "settingDescription": "Sends sample files to Microsoft to help protect device users and your organization from potential threats",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Cloud delivered protection preferences",
      "Cloud delivered protection preferences"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#enable--disable-automatic-sample-submissions"
    ],
    "baseUri": "PayloadContent/cloudService",
    "offsetUri": "automaticSampleSubmissionConsent",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent_safe",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent_none",
        "description": null,
        "helpText": null,
        "name": "None",
        "displayName": "None",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "none"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent_safe",
        "description": null,
        "helpText": null,
        "name": "Safe",
        "displayName": "Safe",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "safe"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent_all",
        "description": null,
        "helpText": null,
        "name": "All",
        "displayName": "All",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "all"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "automaticSampleSubmissionConsent",
    "rootDefinitionId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent_none",
        "description": null,
        "helpText": null,
        "name": "None",
        "displayName": "None",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "none"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent_safe",
        "description": null,
        "helpText": null,
        "name": "Safe",
        "displayName": "Safe",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "safe"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent_all",
        "description": null,
        "helpText": null,
        "name": "All",
        "displayName": "All",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "all"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_exclusions",
    "settingName": "Scan exclusions",
    "settingDescription": "Entities that have been excluded from the scan. Exclusions can be specified by full paths, extensions, or file names.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#scan-exclusions"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "exclusions",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions",
    "rootDefinitionId": "com.apple.managedclient.preferences_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_enablerealtimeprotection",
    "settingName": "Enable real-time protection (deprecated)",
    "settingDescription": "Whether real-time protection (scan files as they are accessed) is enabled or not.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#enable--disable-real-time-protection"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "enableRealTimeProtection",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_enablerealtimeprotection_true",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_enablerealtimeprotection_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_enablerealtimeprotection_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "enableRealTimeProtection",
    "rootDefinitionId": "com.apple.managedclient.preferences_enablerealtimeprotection",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_enablerealtimeprotection_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_enablerealtimeprotection_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_exclusions_item_name",
    "settingName": "Name",
    "settingDescription": "Process name, either or full path or file name, wildcards supported",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "exclusions/[{0}]/name",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "none",
      "inputValidationSchema": null,
      "maximumLength": 1032,
      "minimumLength": 1,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": ""
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions_item_name",
    "rootDefinitionId": "com.apple.managedclient.preferences_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_exclusions_item_path",
    "settingName": "Path",
    "settingDescription": "Path to exclude, wildcards are supported",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "exclusions/[{0}]/path",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
      "format": "none",
      "inputValidationSchema": null,
      "maximumLength": 1032,
      "minimumLength": 1,
      "isSecret": false,
      "fileTypes": []
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
      "settingValueTemplateReference": null,
      "value": ""
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions_item_path",
    "rootDefinitionId": "com.apple.managedclient.preferences_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_maximumondemandscanthreads",
    "settingName": "Degree of parallelism for on-demand scans",
    "settingDescription": "Specifies the degree of parallelism for on-demand scans. This corresponds to the number of threads used to perform the scan and impacts the CPU usage, as well as the duration of the on-demand scan.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences?view=o365-worldwide#degree-of-parallelism-for-on-demand-scans"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "maximumOnDemandScanThreads",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
      "maximumValue": 64,
      "minimumValue": 1
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
      "settingValueTemplateReference": null,
      "value": 2
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "maximumOnDemandScanThreads",
    "rootDefinitionId": "com.apple.managedclient.preferences_maximumondemandscanthreads",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_scanhistorymaximumitems",
    "settingName": "Scan history size",
    "settingDescription": "Specify the maximum number of entries to keep in the scan history. Entries include all on-demand scans performed in the past and all antivirus detections.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#maximum-number-of-items-in-the-antivirus-scan-history"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "scanHistoryMaximumItems",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": null,
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [],
    "referredSettingInformationList": [],
    "valueDefinition": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
      "maximumValue": 15000,
      "minimumValue": 5000
    },
    "defaultValue": {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
      "settingValueTemplateReference": null,
      "value": 10000
    },
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "scanHistoryMaximumItems",
    "rootDefinitionId": "com.apple.managedclient.preferences_scanhistorymaximumitems",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_cloudblocklevel",
    "settingName": "Cloud Block Level",
    "settingDescription": "Determines how aggressive Defender for Endpoint will be in blocking and scanning suspicious files.",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Cloud delivered protection preferences"
    ],
    "infoUrls": [
      "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences?view=o365-worldwide#configure-cloud-block-level"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/cloudService",
    "offsetUri": "cloudBlockLevel",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_cloudblocklevel_0",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_cloudblocklevel_0",
        "description": null,
        "helpText": null,
        "name": "normal",
        "displayName": "normal",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "normal"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_cloudblocklevel_1",
        "description": null,
        "helpText": null,
        "name": "moderate",
        "displayName": "moderate",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "moderate"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_cloudblocklevel_2",
        "description": null,
        "helpText": null,
        "name": "high",
        "displayName": "high",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "high"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_cloudblocklevel_3",
        "description": null,
        "helpText": null,
        "name": "high_plus",
        "displayName": "high_plus",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "high_plus"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_cloudblocklevel_4",
        "description": null,
        "helpText": null,
        "name": "zero_tolerance",
        "displayName": "zero_tolerance",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "zero_tolerance"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "cloudBlockLevel",
    "rootDefinitionId": "com.apple.managedclient.preferences_cloudblocklevel",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_cloudblocklevel_0",
        "description": null,
        "helpText": null,
        "name": "normal",
        "displayName": "normal",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "normal"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_cloudblocklevel_1",
        "description": null,
        "helpText": null,
        "name": "moderate",
        "displayName": "moderate",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "moderate"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_cloudblocklevel_2",
        "description": null,
        "helpText": null,
        "name": "high",
        "displayName": "high",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "high"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_cloudblocklevel_3",
        "description": null,
        "helpText": null,
        "name": "high_plus",
        "displayName": "high_plus",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "high_plus"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_cloudblocklevel_4",
        "description": null,
        "helpText": null,
        "name": "zero_tolerance",
        "displayName": "zero_tolerance",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "zero_tolerance"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled",
    "settingName": "Automatic security intelligence updates",
    "settingDescription": "Determines whether security intelligence updates are installed automatically:",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Cloud delivered protection preferences",
      "Cloud delivered protection preferences"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#enable--disable-automatic-security-intelligence-updates"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/cloudService",
    "offsetUri": "automaticDefinitionUpdateEnabled",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled_true",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "automaticDefinitionUpdateEnabled",
    "rootDefinitionId": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_automaticsamplesubmission",
    "settingName": "Enable / disable automatic sample submissions",
    "settingDescription": "Determines whether suspicious samples (that are likely to contain threats) are sent to Microsoft. You are prompted if the submitted file is likely to contain personal information.",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Cloud delivered protection preferences",
      "Cloud delivered protection preferences"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#enable--disable-automatic-sample-submissions"
    ],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/cloudService",
    "offsetUri": "automaticSampleSubmission",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_automaticsamplesubmission_true",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_automaticsamplesubmission_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_automaticsamplesubmission_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "automaticSampleSubmission",
    "rootDefinitionId": "com.apple.managedclient.preferences_automaticsamplesubmission",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_automaticsamplesubmission_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_automaticsamplesubmission_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "com.apple.managedclient.preferences_enforcementlevel",
    "settingName": "Enforcement level",
    "settingDescription": "Specifies if network protection is disabled, in audit mode, or enforced",
    "categoryId": "269c487f-8902-486a-88dd-db9b9b4454b8",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Network protection",
      "Network protection"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/networkProtection",
    "offsetUri": "enforcementLevel",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "com.apple.managedclient.preferences_enforcementlevel_1",
    "applicability": {
      "description": null,
      "platform": "macOS",
      "deviceMode": "none",
      "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "options": [
      {
        "itemId": "com.apple.managedclient.preferences_enforcementlevel_0",
        "description": null,
        "helpText": null,
        "name": "disabled",
        "displayName": "disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "disabled"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_enforcementlevel_1",
        "description": null,
        "helpText": null,
        "name": "audit",
        "displayName": "audit",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "audit"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_enforcementlevel_2",
        "description": null,
        "helpText": null,
        "name": "block",
        "displayName": "block",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "block"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "enforcementLevel",
    "rootDefinitionId": "com.apple.managedclient.preferences_enforcementlevel",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "com.apple.managedclient.preferences_enforcementlevel_0",
        "description": null,
        "helpText": null,
        "name": "disabled",
        "displayName": "disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "disabled"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_enforcementlevel_1",
        "description": null,
        "helpText": null,
        "name": "audit",
        "displayName": "audit",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "audit"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "com.apple.managedclient.preferences_enforcementlevel_2",
        "description": null,
        "helpText": null,
        "name": "block",
        "displayName": "block",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "block"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_exclusions_item_$type",
    "settingName": "Type",
    "settingDescription": null,
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "exclusions/[{0}]/$type",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_exclusions_item_$type_0",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_exclusions_item_$type_0",
        "description": null,
        "helpText": null,
        "name": "Path",
        "displayName": "Path",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedPath"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_exclusions",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_exclusions_item_isdirectory",
            "required": true
          },
          {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_exclusions_item_path",
            "required": true
          }
        ]
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_exclusions_item_$type_1",
        "description": null,
        "helpText": null,
        "name": "File extension",
        "displayName": "File extension",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedFileExtension"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_exclusions",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_exclusions_item_extension",
            "required": true
          }
        ]
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_exclusions_item_$type_2",
        "description": null,
        "helpText": null,
        "name": "Process name",
        "displayName": "Process name",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedFileName"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_exclusions",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_exclusions_item_name",
            "required": true
          }
        ]
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions_item_$type",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_exclusions_item_$type_0",
        "description": null,
        "helpText": null,
        "name": "Path",
        "displayName": "Path",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedPath"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_exclusions",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_exclusions_item_isdirectory",
            "required": true
          },
          {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_exclusions_item_path",
            "required": true
          }
        ]
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_exclusions_item_$type_1",
        "description": null,
        "helpText": null,
        "name": "File extension",
        "displayName": "File extension",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedFileExtension"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_exclusions",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_exclusions_item_extension",
            "required": true
          }
        ]
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_exclusions_item_$type_2",
        "description": null,
        "helpText": null,
        "name": "Process name",
        "displayName": "Process name",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedFileName"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_exclusions",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_exclusions_item_name",
            "required": true
          }
        ]
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_nonexecmountpolicy",
    "settingName": "non execute mount mute",
    "settingDescription": "Specifies the behavior of RTP on mount point marked as nonexec. ",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/linux-preferences?view=o365-worldwide#muting-non-exec-mounts"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "nonExecMountPolicy",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_nonexecmountpolicy_0",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_nonexecmountpolicy_0",
        "description": null,
        "helpText": null,
        "name": "unmute",
        "displayName": "unmute",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "unmute"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_nonexecmountpolicy_1",
        "description": null,
        "helpText": null,
        "name": "mute",
        "displayName": "mute",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "mute"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "nonExecMountPolicy",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_nonexecmountpolicy",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_nonexecmountpolicy_0",
        "description": null,
        "helpText": null,
        "name": "unmute",
        "displayName": "unmute",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "unmute"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_nonexecmountpolicy_1",
        "description": null,
        "helpText": null,
        "name": "mute",
        "displayName": "mute",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "mute"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_enablerealtimeprotection",
    "settingName": "Enable real-time protection (deprecated)",
    "settingDescription": "Locates and stops malware from installing or running on your device. You can turn off this setting for a short time before it turns back on automatically.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#enable--disable-real-time-protection"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "enableRealTimeProtection",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_enablerealtimeprotection_true",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_enablerealtimeprotection_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_enablerealtimeprotection_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "enableRealTimeProtection",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_enablerealtimeprotection",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_enablerealtimeprotection_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_enablerealtimeprotection_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value",
    "settingName": "Action to take",
    "settingDescription": "Action to take when coming across a threat of the type specified in the preceding section.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Antivirus engine",
      "Antivirus engine"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "threatTypeSettings/[{0}]/value",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value_0",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value_0",
        "description": null,
        "helpText": null,
        "name": "audit",
        "displayName": "audit",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "audit"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value_1",
        "description": null,
        "helpText": null,
        "name": "block",
        "displayName": "block",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "block"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value_2",
        "description": null,
        "helpText": null,
        "name": "off",
        "displayName": "off",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "off"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "threatTypeSettings_item_value",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_threattypesettings",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value_0",
        "description": null,
        "helpText": null,
        "name": "audit",
        "displayName": "audit",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "audit"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value_1",
        "description": null,
        "helpText": null,
        "name": "block",
        "displayName": "block",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "block"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value_2",
        "description": null,
        "helpText": null,
        "name": "off",
        "displayName": "off",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "off"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
            "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_antivirusengine_scanafterdefinitionupdate",
    "settingName": "Enable scanning after definition update",
    "settingDescription": "Specifies whether to start a process scan after new security intelligence updates are downloaded on the device.",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Antivirus engine"
    ],
    "infoUrls": [
      "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/linux-preferences?view=o365-worldwide#run-a-scan-after-definitions-are-updated"
    ],
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "scanAfterDefinitionUpdate",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_scanafterdefinitionupdate_true",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_scanafterdefinitionupdate_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_scanafterdefinitionupdate_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "scanAfterDefinitionUpdate",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_scanafterdefinitionupdate",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_antivirusengine_scanafterdefinitionupdate_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_antivirusengine_scanafterdefinitionupdate_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_cloudservice_diagnosticlevel",
    "settingName": "Diagnostic data collection level",
    "settingDescription": "We encourage you to share your diagnostic and usage data with us to help improve Microsoft products and services.",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Microsoft Defender - Cloud delivered protection preferences",
      "Cloud delivered protection preferences"
    ],
    "infoUrls": [
      "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#diagnostic-collection-level"
    ],
    "baseUri": "PayloadContent/cloudService",
    "offsetUri": "diagnosticLevel",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_cloudservice_diagnosticlevel_0",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_cloudservice_diagnosticlevel_0",
        "description": null,
        "helpText": null,
        "name": "optional",
        "displayName": "optional",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "optional"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_diagnosticlevel_1",
        "description": null,
        "helpText": null,
        "name": "required",
        "displayName": "required",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "required"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "diagnosticLevel",
    "rootDefinitionId": "linux_mdatp_managed_cloudservice_diagnosticlevel",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_cloudservice_diagnosticlevel_0",
        "description": null,
        "helpText": null,
        "name": "optional",
        "displayName": "optional",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "optional"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_cloudservice_diagnosticlevel_1",
        "description": null,
        "helpText": null,
        "name": "required",
        "displayName": "required",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "required"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type",
    "settingName": "Type",
    "settingDescription": null,
    "categoryId": "d2191717-e304-46f7-bcc0-55e6477026c9",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Exclusion Settings"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/exclusionSettings",
    "offsetUri": "exclusions/[{0}]/$type",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type_0",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type_0",
        "description": null,
        "helpText": null,
        "name": "Path",
        "displayName": "Path",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedPath"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_exclusionsettings_exclusions",
            "parentSettingId": "linux_mdatp_managed_exclusionsettings_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "linux_mdatp_managed_exclusionsettings_exclusions_item_isdirectory",
            "required": true
          },
          {
            "dependedOnBy": "linux_mdatp_managed_exclusionsettings_exclusions_item_path",
            "required": true
          }
        ]
      },
      {
        "itemId": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type_1",
        "description": null,
        "helpText": null,
        "name": "Process name",
        "displayName": "Process name",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedFileName"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_exclusionsettings_exclusions",
            "parentSettingId": "linux_mdatp_managed_exclusionsettings_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "linux_mdatp_managed_exclusionsettings_exclusions_item_name",
            "required": true
          }
        ]
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions_item_$type",
    "rootDefinitionId": "linux_mdatp_managed_exclusionsettings_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type_0",
        "description": null,
        "helpText": null,
        "name": "Path",
        "displayName": "Path",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedPath"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_exclusionsettings_exclusions",
            "parentSettingId": "linux_mdatp_managed_exclusionsettings_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "linux_mdatp_managed_exclusionsettings_exclusions_item_isdirectory",
            "required": true
          },
          {
            "dependedOnBy": "linux_mdatp_managed_exclusionsettings_exclusions_item_path",
            "required": true
          }
        ]
      },
      {
        "itemId": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type_1",
        "description": null,
        "helpText": null,
        "name": "Process name",
        "displayName": "Process name",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "excludedFileName"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_exclusionsettings_exclusions",
            "parentSettingId": "linux_mdatp_managed_exclusionsettings_exclusions"
          }
        ],
        "dependedOnBy": [
          {
            "dependedOnBy": "linux_mdatp_managed_exclusionsettings_exclusions_item_name",
            "required": true
          }
        ]
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_exclusionsettings_exclusions_item_isdirectory",
    "settingName": "Is directory",
    "settingDescription": "Directory if selected, or file if not selected",
    "categoryId": "d2191717-e304-46f7-bcc0-55e6477026c9",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Exclusion Settings"
    ],
    "infoUrls": [],
    "baseUri": "PayloadContent/exclusionSettings",
    "offsetUri": "exclusions/[{0}]/isDirectory",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_exclusionsettings_exclusions_item_isdirectory_true",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_exclusionsettings_exclusions_item_isdirectory_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type_0",
            "parentSettingId": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_exclusionsettings_exclusions_item_isdirectory_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type_0",
            "parentSettingId": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "exclusions_item_isDirectory",
    "rootDefinitionId": "linux_mdatp_managed_exclusionsettings_exclusions",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_exclusionsettings_exclusions_item_isdirectory_false",
        "description": null,
        "helpText": null,
        "name": "Disabled",
        "displayName": "Disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "false"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type_0",
            "parentSettingId": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type"
          }
        ],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_exclusionsettings_exclusions_item_isdirectory_true",
        "description": null,
        "helpText": null,
        "name": "Enabled",
        "displayName": "Enabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "true"
        },
        "dependentOn": [
          {
            "dependentOn": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type_0",
            "parentSettingId": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type"
          }
        ],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  },
  {
    "settingId": "linux_mdatp_managed_networkprotection_enforcementlevel",
    "settingName": "Enforcement Level",
    "settingDescription": "Specifies if network protection is disabled, in audit mode, or enforced",
    "categoryId": "269c487f-8902-486a-88dd-db9b9b4454b8",
    "categoryName": "Microsoft Defender",
    "keywords": [
      "Network protection"
    ],
    "infoUrls": [
      "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/network-protection-linux?view=o365-worldwide"
    ],
    "baseUri": "PayloadContent/networkProtection",
    "offsetUri": "enforcementLevel",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "defaultOptionId": "linux_mdatp_managed_networkprotection_enforcementlevel_0",
    "applicability": {
      "description": null,
      "platform": "linux",
      "deviceMode": "none",
      "technologies": "microsoftSense"
    },
    "options": [
      {
        "itemId": "linux_mdatp_managed_networkprotection_enforcementlevel_0",
        "description": null,
        "helpText": null,
        "name": "disabled",
        "displayName": "disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "disabled"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_networkprotection_enforcementlevel_1",
        "description": null,
        "helpText": null,
        "name": "audit",
        "displayName": "audit",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "audit"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_networkprotection_enforcementlevel_2",
        "description": null,
        "helpText": null,
        "name": "block",
        "displayName": "block",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "block"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "referredSettingInformationList": [],
    "valueDefinition": [],
    "defaultValue": [],
    "accessTypes": "none",
    "version": "638889060268539343",
    "helpText": null,
    "name": "enforcementLevel",
    "rootDefinitionId": "linux_mdatp_managed_networkprotection_enforcementlevel",
    "settingDefinitionId": null,
    "definitionDescription": null,
    "dataType": null,
    "valueOptions": [
      {
        "itemId": "linux_mdatp_managed_networkprotection_enforcementlevel_0",
        "description": null,
        "helpText": null,
        "name": "disabled",
        "displayName": "disabled",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "disabled"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_networkprotection_enforcementlevel_1",
        "description": null,
        "helpText": null,
        "name": "audit",
        "displayName": "audit",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "audit"
        },
        "dependentOn": [],
        "dependedOnBy": []
      },
      {
        "itemId": "linux_mdatp_managed_networkprotection_enforcementlevel_2",
        "description": null,
        "helpText": null,
        "name": "block",
        "displayName": "block",
        "optionValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "block"
        },
        "dependentOn": [],
        "dependedOnBy": []
      }
    ],
    "dependencies": []
  }
]